In [1]:
nama = 'fikri'

In [2]:
nama

'fikri'

In [3]:
nama = [nama , nama+'iii' , 'iii' + nama]

In [6]:
nama[2]

'iiifikri'

In [7]:
nama = {
    'depan' : 'fikri',
    'belakang' : 'susilo'
}

In [9]:
nama['depan'] + ' ' +nama['belakang']

'fikri susilo'

In [10]:
ls = [1,2,'fikri' , True]

In [11]:
type(ls)

list

In [12]:
import numpy as np

In [14]:
npArr = np.array(ls)

In [18]:
npArr

array(['1', '2', 'fikri', 'True'], dtype='<U11')

In [16]:
import pandas as pd

In [21]:
serr= pd.Series(npArr , index=['USA' , 'EN' , 'INA' ,'ANI'])

In [23]:
serr['INA']

'fikri'

In [24]:
serr

USA        1
EN         2
INA    fikri
ANI     True
dtype: object

In [25]:
data1 = {
    'isbn' : 234567891,
    'judul' : 'PHP Laravel Handbook',
    'harga' : 120000
}

In [26]:
data = [
    {
        'isbn' : 234567891,
        'judul' : 'PHP Laravel Handbook',
        'harga' : 120000
    },
    {
        'isbn' : 124214,
        'judul' : 'PHP Handbook',
        'harga' : 1200
    }
]

In [29]:
# Bisa dari list2d,
df = pd.DataFrame(data=[[234567891,'PHP Laravel Handbook',120000],[124214,'PHP Handbook',1200]] , columns=['isbn' , 'judul' ,'harga'])
# Dari Dict

In [31]:
df['diskon'] = 5

In [32]:
df

        isbn                 judul   harga  diskon
0  234567891  PHP Laravel Handbook  120000       5
1     124214          PHP Handbook    1200       5

In [37]:
df['hargaSetDiskon'] = df['harga'] - (df['harga'] * df['diskon']//100)

In [38]:
df

        isbn                 judul   harga  diskon  hargaSetDiskon
0  234567891  PHP Laravel Handbook  120000       5          114000
1     124214          PHP Handbook    1200       5            1140

In [40]:
# df.iloc[0]

isbn                         234567891
judul             PHP Laravel Handbook
harga                           120000
diskon                               5
hargaSetDiskon                  114000
Name: 0, dtype: object